<a href="https://colab.research.google.com/github/yooste/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/pandas_chap14_0802.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
l1 = [{'name':'John','job':'teacher'},
      {'name':'Nate','job':'student'},
      {'name':'Fred','job':'developer'}]

l2 = [{'name':'Ed','job':'dentist'},
      {'name':'Jack','job':'farmer'},
      {'name':'Ted','job':'designer'}]

l3 = [{'name':'John','job':'teacher'},
      {'name':'Nate','job':'student'},
      {'name':'Jack','job':'developer'}]

l4 = [{'age':25,'country':'U.S'},
      {'age':30,'country':'U.K'},
      {'age':45,'country':'Korea'}]

In [3]:
df1 = pd.DataFrame(l1, columns = ['name','job'])
df2 = pd.DataFrame(l2, columns = ['name','job'])

In [4]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [5]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

In [6]:
result = pd.concat([df1,df2])   # concat(): 2개의 데이터프레임을 합치는 함수
# 이 때 인덱스가 0,1,2로 반복된다.

In [7]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

In [8]:
result = pd.concat([df1,df2], ignore_index=True)
# ignore_index=True로 설정하면 인덱스 번호가 반복되지 않는다.

In [9]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [12]:
result = df1.append(df2, ignore_index=True) # append함수로 df1에 df2를 이어붙인다.

In [13]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [14]:
df3 = pd.DataFrame(l3, columns=['name','job'])
df4 = pd.DataFrame(l4, columns=['age','country'])

In [15]:
df3

   name        job
0  John    teacher
1  Nate    student
2  Jack  developer

In [16]:
df4

   age country
0   25     U.S
1   30     U.K
2   45   Korea

In [17]:
result = pd.concat([df3,df4],axis=1, ignore_index=True)
# column이 아닌 row로 합치는 방법
# axis=1를 활용하여 df3, df4를 합친다.

In [18]:
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Jack  developer  45  Korea

**Bonus Track**
**데이터프레임이 아닌 리스트 합치기**

In [19]:
label = [1,2,3,4,5]
prediction = [1,2,2,4,4]

In [20]:
comparison = pd.DataFrame({'label':label, 'prediction':prediction})
# 리스트를 데이터프레임으로 만들어서 비교하면 한 눈에 보여 더 쉽게 비교할 수 있음

In [21]:
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4